app/controllers/api/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        @users = User.all.includes({servers: [:users, :rooms]}, :messages).with_attached_profile_picture

INSERT INTO "users" ("username", "username_number", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "users" SET "username_number" = $1, "session_token" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username_number", 3], ["session_token", "7n7rQt-2SnQEdzxnJh_Z0g"], ["updated_at", "2019-05-28 18:36:29.392227"], ["id", 1]]
---
    def create
        @user = User.create(user_params);
        if @user.save