app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.includes( {servers: [:users,:rooms]}, :messages, :private_messages).with_attached_profile_picture.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "t"], ["LIMIT", 1]]