app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 AND "users"."username_number" = $2 LIMIT $3  [["username", "admin"], ["username_number", 2], ["LIMIT", 1]]
---
    def already_exists?(username, number)
        user = User.find_by(username: username, username_number: number)

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "-Bao2WNsSNxxbAONILjshg"], ["LIMIT", 1]]
---
    def ensure_session_token
        while(self.session_token.nil? || User.find_by(session_token: self.session_token ) ) do

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "amPafypR4hk0gGaCsW1zZw"], ["LIMIT", 1]]
UPDATE "users" SET "session_token" = $1, "username_number" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["session_token", "zap9aJJXr7iEdmhHps3-Xg"], ["username_number", 131], ["updated_at", "2019-05-28 18:42:29.833739"], ["id", 1]]
---
    def reset_session_token
        while(User.find_by(session_token: self.session_token ) ) do
            self.session_token = SecureRandom::urlsafe_base64
        end
        self.save!